0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }

    outlet
    {
      type              zeroGradient;
    }

    top
    {
        type            cyclic;
    }

    bottom
    {
        type            cyclic;
    }

    T1
    {
        type            fixedValue;
        value           uniform 400;
    }
    T2
    {
        type            fixedValue;
        value           uniform 400;
    }
    T3
    {
        type            fixedValue;
        value           uniform 400;
    }
    T4
    {
        type            fixedValue;
        value           uniform 400;
    }
    T5
    {
        type            fixedValue;
        value           uniform 400;
    }
    T6
    {
        type            fixedValue;
        value           uniform 400;
    }


    left
    {
        type            empty;
    }

    right
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
